import re

""" Задача:
	В нашата система, за валидно потребителско име се счита низ, с дължина между 2 и 15 символа, като допустими са единствено символите: малка или голяма латинска буква, цифра, подчертавка и тире.

	Даден е списък с потребителски имена (user_names). Вашата задача е да съставите нов списък (valid_user_names), в който ще се съдържат единствено валидните потребителски имена
"""

user_names = [
	"",
	"ада",
	"a",
	"ada!",
	"a_d_a",
	"a-d-a",
	"pesho21",
	"pesho 54",
	"12345678901234567890"
]

valid = re.compile(r"^[\w-]{2,15}$", re.ASCII)
#

newlist = list(filter(valid.match, user_names))
print(newlist)

# ОЧАКВАН РЕЗУЛТАТ:
# Valid user names are: ['a_d_a', 'a-d-a', 'pesho21']

